import '../../../models/wirid_model.dart';

const List<WiridModel> wiridPagi = [
  WiridModel(
    title: 'Doa Fajar',
    arabic: '''
      بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ

      الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ
      حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ عَلَىٰ كُلِّ حَالٍ، حَمْدًا
      يُوَافِي نِعَمَهُ وَيُكَافِئُ مَزِيدَهُ، يَا رَبَّنَا لَكَ الْحَمْدُ كَمَا
      يَنْبَغِي لِجَلَالِ وَجْهِكَ وَعَظِيمِ سُلْطَانِكَ

      سُبْحَانَكَ لَا نُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَىٰ نَفْسِكَ

      اللَّهُمَّ صَلِّ عَلَىٰ سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ
      وَرَسُولِكَ النَّبِيِّ الْأُمِّيِّ، وَعَلَىٰ آلِ سَيِّدِنَا مُحَمَّدٍ
      وَأَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْتَ عَلَىٰ سَيِّدِنَا إِبْرَاهِيمَ
      وَعَلَىٰ آلِ سَيِّدِنَا إِبْرَاهِيمَ

      وَبَارِكْ عَلَىٰ سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ
      وَرَسُولِكَ النَّبِيِّ الْأُمِّيِّ، وَعَلَىٰ آلِ سَيِّدِنَا مُحَمَّدٍ
      وَأَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَىٰ سَيِّدِنَا إِبْرَاهِيمَ
      وَعَلَىٰ آلِ سَيِّدِنَا إِبْرَاهِيمَ فِي الْعَالَمِينَ

      إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ إِنِّي أَسْأَلُكَ رَحْمَةً مِنْ
      عِنْدِكَ تَهْدِي بِهَا قَلْبِي وَتَجْمَعُ بِهَا شَمْلِي وَتَلُمُّ
      بِهَا شَعَثِي وَتُصْلِحُ بِهَا دِينِي وَتَحْفَظُ بِهَا غَائِبِي وَ
      تَرْفَعُ بِهَا شَاهِدِي وَتُزَكِّي بِهَا عَمَلِي وَتُبَيِّضُ بِهَا
      وَجْهِي وَتُلْهِمُنِي بِهَا رُشْدِي وَتَعْصِمُنِي بِهَا مِنْ كُلِّ سُوءٍ،
      اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا دَائِمًا يُبَاشِرُ قَلْبِي وَأَسْأَلُكَ
      يَقِينًا صَادِقًا حَتَّى أَعْلَمَ أَنَّهُ لَنْ يُصِيبَنِي إِلَّا مَا كَتَبْتَ
      وَرَضِّنِي بِمَا قَسَمْتَهُ لِي، اللَّهُمَّ أَعْطِنِي إِيمَانًا صَادِقًا
      وَيَقِينًا لَيْسَ بَعْدَهُ كُفْرٌ وَرَحْمَةً أَنَالُ بِهَا شَرَفَ
      كَرَامَتِكَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ
      الصَّبْرَ عِنْدَ الْقَضَاءِ وَالْفَوْزَ عِنْدَ اللِّقَاءِ وَمَنَازِلَ
      الشُّهَدَاءِ وَعَيْشَ السُّعَدَاءِ وَالنَّصْرَ عَلَى الْأَعْدَاءِ
      وَمُرَافَقَةَ الْأَنْبِيَاءِ.

      الشُّهَدَاءِ وَعَيْشَ السُّعَدَاءِ وَالنَّصْرَ عَلَى الْأَعْدَاءِ
      وَمُرَافَقَةَ الْأَنْبِيَاءِ، اللَّهُمَّ إِنِّي أَنْزِلُ بِكَ حَاجَتِي وَ
      إِنْ قَصُرَ رَأْيِي وَقَصُرَ عَمَلِي وَافْتَقَرْتُ إِلَى رَحْمَتِكَ
      وَأَسْأَلُكَ يَا قَاضِيَ الْأُمُورِ وَيَا شَافِيَ الصُّدُورِ كَمَا
      تُجِيرُ بَيْنَ الْبُحُورِ أَنْ تُجِيرَنِي مِنْ عَذَابِ السَّعِيرِ وَمِنْ
      دَعْوَةِ الثُّبُورِ وَفِتْنَةِ الْقُبُورِ، اللَّهُمَّ مَا ضَعُفَتْ
      عَنْهُ رَأْيِي وَقَصُرَ عَنْهُ عَمَلِي وَلَمْ تَبْلُغْهُ نِيَّتِي
      وَأَشْتَقِي مِنْ خَيْرٍ وَعَدْتَهُ أَحَدًا مِنْ عِبَادِكَ أَوْ
      خَيْرٍ أَنْتَ مُعْطِيهِ أَحَدًا مِنْ خَلْقِكَ فَإِنِّي أَرْغَبُ
      إِلَيْكَ فِيهِ وَأَسْأَلُكَ رَبَّ الْعَالَمِينَ، اللَّهُمَّ اجْعَلْنَا
      هَادِينَ مُهْتَدِينَ غَيْرَ ضَالِّينَ وَلَا مُضِلِّينَ حَرْبًا
      لِأَعْدَائِكَ وَسِلْمًا لِأَوْلِيَائِكَ نُحِبُّ بِحُبِّكَ النَّاسَ

      وَنَادِي فِي بَعْدِ أَوْلَئِكَ مَنْ خَالَفَكَ مِنْ خَلْقِكَ، اللَّهُمَّ
      هَذَا الدُّعَاءُ وَمِنْكَ الْإِجَابَةُ وَهَذَا الْجُهْدُ مِنِّي وَ
      عَلَيْكَ التُّكْلَانُ وَإِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ وَلَا
      حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ ذِي الْجَلَالِ
      الشَّدِيدِ وَالْأَمْرِ الرَّشِيدِ أَسْأَلُكَ الْأَمْنَ بِسُرُورِ
      الْوَعِيدِ وَالْجَنَّةِ يَوْمَ الْخُلُودِ مَعَ الْمُقَرَّبِينَ الشُّهُودِ
      وَالرُّكُوعِ السُّجُودِ وَالْمُوفِينَ لَكَ بِالْعُهُودِ، إِلَهِي
      رَحِيمٌ وَدُودٌ وَأَنْتَ تَفْعَلُ مَا تُرِيدُ، سُبْحَانَ مَنْ
      تَعَطَّفَ بِالْعِزِّ وَقَالَ سُبْحَانَ مَنْ لَيْسَ الْمَجِيدُ
      وَتَكَرَّمَ، سُبْحَانَ مَنْ لَا يَنْبَغِي التَّسْبِيحُ إِلَّا لَهُ
      سُبْحَانَ ذِي الْفَضْلِ وَالنَّعْمَةِ سُبْحَانَ ذِي الْقُدْرَةِ
      وَالْكَرَمِ سُبْحَانَ ذِي الْجَلَالِ وَالْإِكْرَامِ سُبْحَانَ

      الَّذِي أَحْصَى كُلَّ شَيْءٍ بِعِلْمِهِ، اللَّهُمَّ اجْعَلْ لِي نُورًا
      فِي قَلْبِي وَنُورًا فِي قَبْرِي وَنُورًا فِي سَمْعِي وَنُورًا فِي
      بَصَرِي وَنُورًا فِي شَعْرِي وَنُورًا فِي بَشَرِي وَنُورًا فِي
      لَحْمِي وَنُورًا فِي دَمِي وَنُورًا فِي عِظَامِي وَنُورًا فِي
      عَصَبِي وَنُورًا مِنْ بَيْنِ يَدَيَّ وَنُورًا مِنْ خَلْفِي
      وَنُورًا عَنْ يَمِينِي وَنُورًا عَنْ شِمَالِي وَنُورًا مِنْ
      فَوْقِي وَنُورًا مِنْ تَحْتِي، اللَّهُمَّ زِدْنِي نُورًا وَ
      أَعْطِنِي نُورًا وَاجْعَلْ لِي نُورًا أَسْأَلُكَ يَا اللَّهُ
      يَا رَحْمَنُ يَا رَحِيمُ يَا مَلِكُ يَا قُدُّوسُ يَا سَلَامُ يَا
      مُؤْمِنُ يَا مُهَيْمِنُ يَا عَزِيزُ يَا جَبَّارُ يَا مُتَكَبِّرُ يَا
      خَالِقُ يَا بَارِئُ يَا مُصَوِّرُ يَا غَفَّارُ يَا قَهَّارُ يَا وَهَّابُ
      يَا رَزَّاقُ يَا فَتَّاحُ يَا عَلِيمُ يَا قَابِضُ يَا بَاسِطُ
      يَا خَافِضُ، يَا رَافِعُ، يَا مُعِزُّ، يَا مُذِلُّ،
      يَا سَمِيعُ، يَا بَصِيرُ، يَا حَكَمُ، يَا عَدْلُ
      يَا لَطِيفُ، يَا خَبِيرُ، يَا حَلِيمُ،
      يَا عَظِيمُ، يَا غَفُورُ، يَا شَكُورُ، يَا عَلِيُّ، يَا كَبِيرُ
      يَا حَفِيظُ، يَا مُقِيتُ، يَا حَسِيبُ،
      يَا جَلِيلُ، يَا كَرِيمُ، يَا رَقِيبُ، يَا مُجِيبُ، يَا وَاسِعُ
      يَا حَكِيمُ، يَا وَدُودُ، يَا مَجِيدُ، يَا بَاعِثُ،
      يَا شَهِيدُ، يَا حَقُّ، يَا وَكِيلُ، يَا قَوِيُّ
      يَا مَتِينُ، يَا وَلِيُّ، يَا حَمِيدُ، يَا مُحْصِي،
      يَا مُبْدِئُ، يَا مُعِيدُ، يَا مُحْيِي، يَا مُمِيتُ
      يَا حَيُّ، يَا قَيُّومُ، يَا وَاجِدُ، يَا مَاجِدُ،
      يَا وَاحِدُ، يَا صَمَدُ، يَا قَادِرُ، يَا مُقْتَدِرُ
      يَا مُقَدِّمُ، يَا مُؤَخِّرُ، يَا أَوَّلُ، يَا آخِرُ،
      يَا ظَاهِرُ، يَا بَاطِنُ، يَا وَالِي، يَا مُتَعَالِي
      يَا بَرُّ، يَا تَوَّابُ، يَا مُنْتَقِمُ، يَا عَفُوُّ، يَا رَؤُوفُ،
      يَا مَالِكَ الْمُلْكِ، يَا ذَا الْجَلَالِ وَالْإِكْرَامِ
      يَا مُقْسِطُ، يَا جَامِعُ، يَا غَنِيُّ، يَا مُغْنِي،
      يَا مَانِعُ، يَا ضَارُّ، يَا نَافِعُ، يَا نُورُ
      يَا هَادِي، يَا بَدِيعُ، يَا بَاقِي،
      يَا وَارِثُ، يَا رَشِيدُ، يَا صَبُورُ
      ''',
    latin: '',
    meaning: '',
  ),

  WiridModel(
    title: 'Wirdhul Lathif',
    arabic: 'bismillah',
  ),
];
